{
    "PL": {
        "menu1": "START",
        "menu2": "O MNIE",
        "menu3": "ŻYCIORYS",
        "menu4": "UMIEJĘTNOŚCI",
        "menu5": "PORTFOLIO",
        "menu6": "KONTAKT",
        "menu7": "Zaprojektowane przez &copy;&nbsp;",
        "home1": "Cześć, jestem",
        "home2": "Mateusz Wuchnicki",
        "home3": "Specjalista ds. GIS, Analityk danych&#10;oraz pasjonat Data Science i uczenia maszynowego&#10;z Krakowa, Polska",
        "home4": "POBIERZ CV",
        "home5": "Wersja polska",
        "home6": "Wersja angielska",
        "about1": "Imię i nazwisko ",
        "about2": "Urodziny ",
        "about3": "1 lutego 1994",
        "about4": "E-mail ",
        "about5": "Adres ",
        "about6": "Kraków, Polska",
        "about7": "Telefon ",
        "about8": "O mnie",
        "about9": "Specjalista ds. GIS, fotogrametrii&#10;i teledetekcji",
        "about10": "Jestem wykwalifikowanym inżynierem z ponad siedmioletnim doświadczeniem. Brałem czynny udział w wielu projektach komercyjnych i&nbsp;badawczo&ndash;rozwojowych. Wykonywałem wiele analiz przestrzennych, opracowywałem ortofotomapy, modele terenu oraz chmury punktów pochodzące z lotniczego skaningu laserowego, a także pisałem sprawozdania techniczne. Byłem odpowiedzialny między innymi za planowanie, monitorowanie i koordynowanie misji lotniczych, których celem było pozyskanie wysokorozdzielczych zdjęć lotniczych i chmury punktów ALS. Posiadam wyjątkowe umiejętności analityczne, organizacyjne, planistyczne i&nbsp;komunikacyjne oraz skoncentrowane podejście do pracy w&nbsp;ustrukturyzowanym środowisku. Poszukuję pracy, w&nbsp;której wykorzystam moje umiejętności i będę mógł dalej się rozwijać w szerokopojętej branży GIS.",
        "about11": "Hobby &#124; Zainteresowania",
        "about12": "Zdobywanie szczytów górskich",
        "about13": "Bieganie",
        "about14": "Finanse osobiste&#10;i inwestowanie",
        "about15": "Data Science&#10;&amp; Analysis",
        "about16": "E-Sport",
        "resume1": "Życiorys",
        "resume2": "„Dobre decyzje są wynikiem doświadczenia, a doświadczenie zdobywa się poprzez podejmowanie błędnych decyzji.”",
        "resume3": "&ndash; Mark Twain",
        "resume4": "Doświadczenie",
        "resume5": "Menager ds. technicznych w dziale technologii lotniczych",
        "resume6": "SmallGIS Sp. z o.o. <span>&#124;</span> Kraków</div>",
        "resume7": "W wewnątrznej strukturze firmy pełniłem funkcję menagera do spraw technicznych w dziale technologii lotniczych. Byłem odpowiedzialny za&nbsp;sprawne działanie i merytoryczne wsparcie zespołu analityków oraz&nbsp;personelu technicznego. Równocześnie sprawowałem funkcję nadzoru operacyjnego misji lotniczych.",
        "resume8": "Do moich opowiązków należało:",
        "resume9": "Koordynowanie i nadzorowanie projektów fotogrametrycznych",
        "resume10": "Kierowanie zespołem, zapewnianie wsparcia i zasobów do realizacji zadań",
        "resume11": "Nadzorowanie prac badawczo-rozwojowych nad nowymi technologiami lotniczymi",
        "resume12": "Utrzymywanie dokładnej dokumentacji technicznej i operacyjnej dla systemów lotniczych",
        "resume13": "Optymalizacja procesów produkcji ortofotomap oraz danych LIDAR",
        "resume14": "Organizowanie szkoleń dla zespołu technicznego",
        "resume15": "Identyfikowanie potencjalnych zagrożeń związanych z realizacją projektów",
        "resume16": "Współpraca z klientami w zakresie specyfikacji technicznych wymagań dotyczących produktów lotniczych",
        "resume17": "Analityk ds. GIS, Fotogrametrii &#10;i Teledetekcji",
        "resume18": "Praca w działe technologii lotniczych, w których uczestniczyłem w wielu projektach fotogrametrycznych oraz badawczych. Pełniłem funkcję nadzoru operacyjnego misji lotniczych zapewniając efektywne i bezpieczne przeprowadzenie operacji lotniczych w celu pozyskania zdjęć lotniczych oraz&nbsp;wykonania skaningu laserowego.",
        "resume19": "Przeprowowadzanie analiz geoprzestrzennych",
        "resume20": "Opracowywanie ortofotomap lotniczych oraz danych LiDAR (ALS)",
        "resume21": "Przetwarzanie zobrazowań satelitarnych oraz hiperspektralnych",
        "resume22": "Komplekswe planowanie, monitorowanie i koordynacja misji lotniczych",
        "resume23": "Koordynowanie działań z różnymi organami i jednostkami wojskowymi",
        "resume24": "Tworzenie dokumentacji projektowej oraz raportów z misji lotniczych",
        "resume25": "Bezpośredni kontakt z klientami",
        "resume26": "Technik GIS",
        "resume27": "Pracując w dziele GIS rozwinąłem swoje umiejętności z zakresu przetwarzania danych wektorowych i rastrowych. Poznałem oprogramowanie oraz techniki opracowywania danych przestrzennych. W&nbsp;trakcie pracy na tym stanowisku, przeniosłem się do działu technologii lotniczych.",
        "resume28": "Opracowywanie ortofotomap lotniczych oraz danych LiDAR",
        "resume29": "Przeprowadzanie analiz przestrzennych",
        "resume30": "Przetwarzanie danych wektorowych i rastrowych",
        "resume31": "Prowadzenie szkoleń z zakresu analiz i oprogramowania GIS",
        "resume32": "Bezpośredni kontakt z klientami",
        "resume33": "Stażysta",
        "resume34": "Pracę rozpocząłem po ukończeniu I stopnia studiów. W trakcie stażu uczestniczyłem w wielu projektach GISowych tj. kartowanie największego Arboretum w Polsce, aktualizacja i opracowywanie MPZP, przetwarzanie zdjęć lotniczych dla projektu NCBiR.",
        "resume35": "Przetwarzanie wysokorozdzielczych zdjęć lotniczych i zobrazowań satelitarnych",
        "resume36": "Tworzenie raportów oraz sprawozdań dotyczących analiz i projektów",
        "resume37": "Przetwarzanie i migracja danych z różnych źródeł",
        "resume38": "Przygotowywania dokumentajci technicznej",
        "resume39": "Technik fotogrametrii",
        "resume40": "GEOCARTIS Sp. z o.o. Sp. K. <span>&#124;</span> Poznań",
        "resume41": "Trzy miesięczny staż w branży fotogrametrycznej, w trakcie którego dobrze nauczyłem się tworzyć modele 3D oraz pracy z chmurą punktów pochodzącą ze skaningu laserowego.",
        "resume42": "Tworzenie modeli BIM (np. bloków mieszkaniowych, zajezdni autobudowych)",
        "resume43": "Opracowywanie rzutów mieszkań na podstawie chmury punktów TLS",
        "resume44": "Pozyskiwanie chmury punktów TLS z użyciem skanera laserowego Leica",
        "resume45": "Tworzenie kompleksowej dokumentacji projektowej",
        "resume46": "GEOMAT Sp. z o.o. <span>&#124;</span> Poznań",
        "resume47": "Trzy miesięczny staż w branży geodezyjnej, w trakcie którego poznałem narzędzia do projektowania map i baz danych. Udoskonaliłem swoje umiejętności posługiwania się instrumentami geodezyjnymi.",
        "resume48": "Aktualizacja bazy BDOT10k oraz redakcję kartograficzna bazy KARTO10k",
        "resume49": "Kontrola atrybutów obiektów bazy GESUT oraz tworzenie map tematycznych",
        "resume50": "Wykonywanie pomiarów geodezyjnych",
        "resume51": "Kursy i szkolenia",
        "resume52": "Sages, Kodołamacz <span>&#124;</span> Warszawa",
        "resume53": "Kurs online, 420 godz.",
        "resume54": "Intensywny, połroczny kurs Data Science, dzięki któremu sprawnie posługuję się językiem python oraz jego bibliotekami służącymi do analizy danych.",
        "resume55": "Nabyte umiejętności:",
        "resume56": "Python: NumPy, Pandas; matplotlib, seaborn, scikit-learn, Keras",
        "resume57": "upyter Notebook (Linux), PyCharm, Google Colaborator, SQL, kontrola wersji Git",
        "resume58": "Metody uczenia maszynowego oraz techniki modelowania: szeregi czasowe, regresja liniowa i logistyczna, SVM, drzewa decyzyjne, lasy losowe, PCA, analiza skupień, algorytm XGBoost",
        "resume59": "Pozyskiwanie i procesowanie danych z różnych źródeł: .csv, .xml, .json",
        "resume60": "Transformacje danych, schematy ewaluacji (train-test, walidacja krzyżowa), ocena istotności zmiennych",
        "resume61": "Optymalizacja hiperparametrów, automatyzacja procesu modelowania (pipelines), walidacja modeli",
        "resume62": "Statystyczne metody analizy danych, estymacja i weryfikacja",
        "resume63": "Podstawowe sieci neuronowe (Deep learning), klasyfikacja obrazów i tekstów",
        "resume64": "Python for Data Science and Machine Learning",
        "resume65": "Kurs online, 25 godz.",
        "resume66": "Python: NumPy, Pandas, matplotlib, scikit-learn",
        "resume67": "Jupyter Notebook (Linux), PyCharm",
        "resume68": "Metody uczenia maszynowego: regresja liniowa i logistyczna, drzewa decyzyjne i lasy losowe",
        "resume69": "Python dla początkujących",
        "resume70": "Kurs online, 25 godz.",
        "resume71": "Python: pętle, instrukcje warunkowe, funkcje",
        "resume72": "IDLE, PyCharm",
        "resume73": "Awans Kompetencyjny",
        "resume74": "Uniwersytet im. Adama Mickiewicza <span>&#124;</span> Poznań",
        "resume75": "Staż stacjonarny, 3 miesiące",
        "resume76": "Innowacyjne kompetencje geografa na współczesnym rynku pracy: wysokiej jakości program stażowy dla studentów nauk o Ziemi na&nbsp;Wydziale Nauk Geograficznych i Geodezyjnych na Uniwersytecie im.&nbsp;Adama Mickiewicza w Poznaniu.",
        "resume77": "Wykształcenie",
        "resume78": "Geoinformacja <span>&#124;</span> Inżynier",
        "resume79": "<span class='underline'>Temat pracy inżynierskiej:</span> „Aplikacja mapowa z funkcjonalnością geokwestionariusza &ndash; szablon portalu geoinformacyjnego”",
        "resume81": "Aplikacja internetowa będąca kreatorem portalu geoinformacyjnego umożliwiająca stworzenie dowolnej ankiety w oparciu o dane przestrzenne z podkładem mapowym.&#10;(Technologie: HTML, CSS, JavaScript, PHP)",
        "skill1": "Umiejętności",
        "skill2": "„Bardzo wierzę w szczęście i uważam, że im ciężej pracuję, tym więcej go mam.”",
        "skill3": "Znajomość języków",
        "skill4": "Kliknij tutaj",
        "skill5": "Języki obce",
        "skill6": "Polski (ojczysty), Angielski (B2)",
        "skill7": "Bazy danych",
        "skill8": "Kontrola wersji",
        "skill9": "Biblioteki uczenia maszynowego",
        "skill10": "Eksploracja danych",
        "skill11": "Pozyskiwanie i procesowanie danych, czyszczenie danych, wizualizacja danych, analiza jednoczynnikowa&#10;i dwuwymiarowa, wykrywanie wartości odstających, testowanie statystyczne",
        "skill12": "Metody i techniki modelowania",
        "skill13": "Regresja liniowa i logistyczna, SVM, drzewa decyzyjne,&#10;lasy losowe, algorytm XGBoost, analiza skupień",
        "skill14": "Modelowanie",
        "skill15": "Transformacje danych, schematy ewaluacji, optymalizacja hiperparametrów, automatyzacja procesu modelowania (pipelines), walidacja modeli",
        "skill16": "Oprogramowanie",
        "skill17": "Data Science &#10;&#38; Analysis",
        "skill18": "Geograficzne / GIS",
        "skill19": "Teledetekcja&#10;i&nbsp;Fotogrametria",
        "skill20": "Trimble Inpho, TerraSolid, Agisoft Metashape,&#10;Riegl Software, Inertial Explorer, iX Capture,&#10;CATALYST od PCI Geomatics",
        "skill21": "Graficzne i kreatywne",
        "skill22": "Umiejętności miękkie",
        "skill23": "Komunikacja",
        "skill24": "Płynnie komunikuję się (w formie pisemnej i ustnej) ze współpracownikami i klientami",
        "skill25": "Rozwiązywanie problemów",
        "skill26": "Potrafię spokojnie przeanalizować sytuację i zidentyfikować możliwe rozwiązania",
        "skill27": "Zarządzanie czasem",
        "skill28": "Potrafię efektywnie zarządzać wieloma zadaniami jednocześnie",
        "skill29": "Odpowiedzialność",
        "skill30": "Jestem świadomy konsekwencji swoich decyzji",
        "skill31": "Praca zespołowa",
        "skill32": "Posiadam łatwość współpracy z innymi, aby osiągnąć wspólny cel",
        "skill33": "Elastyczność",
        "skill34": "Potrafię dostosować się do zmieniających się potrzeb projektowych",
        "skill35": "Samodzielność",
        "skill36": "Samodzielnie wykonuję powierzone mi zadania",
        "skill37": "Przywództwo",
        "skill38": "Potrafię rozwiązywać konflikty, monitorować postępy i utrzymać harmonię w grupie",
        "skill39": "Pewność siebie",
        "skill40": "Jestem pewny swoich umiejętności zawodowych, swobodnie wyrażam swoje opinie",
        "skill41": "Rzetelność",
        "skill42": "Skrupulatnie i dokładnnie wykonuje obowiązki",
        "skill43": "Podstawowe programy",
        "skill44": "Systemy opracyjne",
        "skill45": "Komunikacja",
        "skill46": "Współpraca",
        "skill47": "assets/images/skills-circle_newPL.png",
        "portfolio1": "Portfolio",
        "portfolio2": "„Jeśli kochasz to co robisz i sprawia Ci to radość, cała ciężka praca&#10;i wytrwałość się opłacią.”",
        "portfolio3": "Filtruj:",
        "portfolio4": "Wszystkie<span class=\"category-count\">11</span>",
        "portfolio5": "Projekty GIS<span class=\"category-count\">1</span>",
        "portfolio6": "Projekty graficzne<span class=\"category-count\">3</span>",
        "portfolio7": "Projekty GIS, Front&ndash;End",
        "portfolio8": "Narzędzie partycymacyjne &ndash; geoankieta",
        "portfolio9": "OTWÓRZ",
        "portfolio10": "Klasyfikacja kotów i psów z użyciem CNN Keras",
        "portfolio11": "Rozpoznanie cukrzycy i ocena czynników ryzyka",
        "portfolio12": "Prognozowanie cen domów jednorodzinnych",
        "portfolio13": "Katastrofa Tytanika",
        "portfolio14": "Własna strona &ndash; CV",
        "portfolio15": "Pobieranie danych ze stron WWW",
        "portfolio16": "Generator haseł",
        "portfolio17": "Projekty graficzne",
        "portfolio18": "Zaproszenia ślubne",
        "portfolio19": "Logo i wizytówki",
        "contact1": "Kontakt",
        "contact2": "Kto mówi &ndash; sieje, kto słucha &ndash; zbiera.",
        "contact3": "Skontaktuj się ze mną telefonicznie lub poprzez formularz poniżej",
        "contact4": "Zadzwoń do mnie",
        "contact5": "Napisz do mnie",
        "contact6": "Adres",
        "contact7": "Kraków, Polska",
        "contact8": "Twoje Imię*",
        "contact9": "Twój adres E-mail*",
        "contact10": "Twój numer telefonu",
        "contact11": "Tytuł wiadomości*",
        "contact12": "Treść wiadomości*",
        "contact13": "Wyślij wiadomość",
        "contact14": "Pole oznaczone * są wymagane"
    },
    "EN": {
        "menu1": "HOME",
        "menu2": "ABOUT ME",
        "menu3": "RESUME",
        "menu4": "SKILLS",
        "menu5": "PORTFOLIO",
        "menu6": "CONTACT",
        "menu7": "Designed by &copy;&nbsp;",
        "home1": "Hello, I'm",
        "home2": "Mateusz Wuchnicki",
        "home3": "GIS Specialist, Data Analyst&#10;and enthusiast of Data Science and Machine Learning&#10;from Krakow, Poland",
        "home4": "DOWNLOAD CV",
        "home5": "Polish version",
        "home6": "English version",
        "about1": "Name and Surname ",
        "about2": "Birthday ",
        "about3": "February 1, 1994",
        "about4": "Email ",
        "about5": "Address ",
        "about6": "Krakow, Poland",
        "about7": "Phone ",
        "about8": "About Me",
        "about9": "Specialist in GIS, Photogrammetry&#10;and Remote Sensing",
        "about10": "I am a qualified engineer with over seven years of experience. I&nbsp;have actively participated in numerous commercial and research&ndash;development projects. I&nbsp;have conducted many spatial analyses, developed orthophotomaps, terrain models, and point clouds from airborne laser scanning, as well as written technical reports. I&nbsp;have been responsible for planning, monitoring, and&nbsp;coordinating flight missions aimed at acquiring high-resolution aerial photos and ALS point clouds. I possess exceptional analytical, organizational, planning, and communication skills, along with a focused approach to working in a structured environment. I am seeking a job where I can utilize my skills and continue to grow within the broad GIS industry.",
        "about11": "Hobbies &#124; Interests",
        "about12": "Mountain Climbing",
        "about13": "Running",
        "about14": "Personal Finance&#10;&amp; Investing",
        "about15": "Data Science&#10;&amp; Analysis",
        "about16": "E-Sport",
        "resume1": "Resume",
        "resume2": "„Good decisions come from experience. Experience comes from making bad decisions.”",
        "resume3": "&ndash; Mark Twain",
        "resume4": "Work Experience",
        "resume5": "Technical Manager in the Aviation Technology Department",
        "resume6": "SmallGIS Sp. z o.o. <span>&#124;</span> Krakow</div>",
        "resume7": "Within the company's internal structure, I served as a technical manager in the aviation technology department. I was responsible for the efficient operation and substantive support of the team of analysts and technical staff. At the same time, I performed the function of operational supervision of aviation missions.",
        "resume8": "My duties included:",
        "resume9": "Coordinating and supervising photogrammetric projects",
        "resume10": "Leading a team, providing support and resources to accomplish tasks",
        "resume11": "Supervising research and development work on new aviation technologies",
        "resume12": "Maintaining accurate technical and operational documentation for aviation systems",
        "resume13": "Optimizing production processes for orthophotos and LIDAR data",
        "resume14": "Organizing training for the technical team",
        "resume15": "Identifying potential risks associated with project implementation",
        "resume16": "Collaborating with clients on technical specifications for aviation products",
        "resume17": "GIS, Photogrammetry and Remote Sensing Analyst",
        "resume18": "Working in the aviation technology department, where I participated in many photogrammetric and research projects. I served as operational supervisor of aviation missions, ensuring efficient and safe conduct of aviation operations to obtain aerial images and perform laser scanning.",
        "resume19": "Conducting geospatial analyses",
        "resume20": "Developing aerial orthophotos and LiDAR (ALS) data",
        "resume21": "Processing satellite and hyperspectral imagery",
        "resume22": "Comprehensive planning, monitoring, and coordination of aviation missions",
        "resume23": "Coordinating activities with various authorities and military units",
        "resume24": "Creating project documentation and reports from aviation missions",
        "resume25": "Direct contact with clients",
        "resume26": "GIS Technician",
        "resume27": "While working in the GIS department, I developed my skills in vector and raster data processing. I learned software and techniques for developing spatial data. While working in this position, I moved to the aviation technology department.",
        "resume28": "Developing aerial orthophotos and LiDAR data",
        "resume29": "Conducting spatial analyses",
        "resume30": "Processing vector and raster data",
        "resume31": "Conducting training in GIS analysis and software",
        "resume32": "Direct contact with clients",
        "resume33": "Intern",
        "resume34": "I started work after completing my first degree studies. During my internship, I participated in many GIS projects, such as mapping the largest Arboretum in Poland, updating and developing spatial development plans, and processing aerial images for the project of the National Centre for Research and Development (NCBR).",
        "resume35": "Processing high-resolution aerial images and satellite imagery",
        "resume36": "Creating reports and reports on analyzes and projects",
        "resume37": "Processing and migrating data from various sources",
        "resume38": "Preparing technical documentation",
        "resume39": "Photogrammetry Technician",
        "resume40": "GEOCARTIS Sp. z o.o. Sp. K. <span>&#124;</span> Poznan",
        "resume41": "A three-month internship in the photogrammetry industry, where I learned to create 3D models and work with point clouds from laser scanning.",
        "resume42": "Creating BIM models (e.g., residential blocks, bus depots)",
        "resume43": "Developing apartment layouts based on TLS point clouds",
        "resume44": "Acquiring TLS point clouds using a Leica laser scanner",
        "resume45": "Creating comprehensive project documentation",
        "resume46": "GEOMAT Sp. z o.o. <span>&#124;</span> Poznan",
        "resume47": "A three-month internship in the geodesy industry, during which I learned tools for designing maps and databases. I improved my skills in using surveying instruments.",
        "resume48": "Updating the BDOT10k database and cartographic editing of the KARTO10k database",
        "resume49": "Controlling the attributes of GESUT database objects and creating thematic maps",
        "resume50": "Conducting geodetic measurements",
        "resume51": "Courses and Training",
        "resume52": "Sages, Kodołamacz <span>&#124;</span> Warsaw",
        "resume53": "Online course, 420 hours",
        "resume54": "An intensive, six-month Data Science course, thanks to which I am proficient in Python and its libraries for data analysis.",
        "resume55": "Skills acquired:",
        "resume56": "Python: NumPy, Pandas, matplotlib, seaborn, scikit-learn, Keras",
        "resume57": "Jupyter Notebook (Linux), PyCharm, Google Colaboratory, SQL, version control Git",
        "resume58": "Machine learning methods and modeling techniques: time series, linear and logistic regression, SVM, decision trees, random forests, PCA, cluster analysis, XGBoost algorithm",
        "resume59": "Acquiring and processing data from various sources: .csv, .xml, .json",
        "resume60": "Data transformations, evaluation schemes (train-test, cross-validation), variable importance assessment",
        "resume61": "Hyperparameter optimization, automation of the modeling process (pipelines), model validation",
        "resume62": "Statistical methods of data analysis, estimation, and verification",
        "resume63": "Basic neural networks (Deep Learning), image and text classification",
        "resume64": "Python for Data Science and Machine Learning",
        "resume65": "Online course, 25 hours",
        "resume66": "Python: NumPy, Pandas, matplotlib, scikit-learn",
        "resume67": "Jupyter Notebook (Linux), PyCharm",
        "resume68": "Machine learning methods: linear and logistic regression, decision trees and random forests",
        "resume69": "Python for Beginners",
        "resume70": "Online course, 25 hours",
        "resume71": "Python: loops, conditional instructions, functions",
        "resume72": "IDLE, PyCharm",
        "resume73": "Awans Kompetencyjny&#10;internship&ndash;programme",
        "resume74": "Adam Mickiewicz University <span>&#124;</span> Poznan",
        "resume75": "On-site internship, 3 months",
        "resume76": "Innovative competencies of a geographer in the modern job market: a high-quality internship program for students of Earth Sciences at the Faculty of Geographical and Geological Sciences at Adam Mickiewicz University in Poznan.",
        "resume77": "Education",
        "resume78": "Geoinformation <span>&#124;</span> Bachelor of Science",
        "resume79": "<span class='underline'>Thesis topic:</span> „Map Application with Geo-Survey Functionality &ndash; Geoinformation Portal Template”",
        "resume81": "A web application serving as a creator of a geoinformation portal enabling the creation of any survey based on spatial data with a map background.&#10;(Technologies: HTML, CSS, JavaScript, PHP)",
        "skill1": "Skills",
        "skill2": "„I am a great believer in luck, and I find the harder I work the more I have of it.”",
        "skill3": "Languages",
        "skill4": "Click here",
        "skill5": "Foreign Languages",
        "skill6": "Polish (native), English (B2)",
        "skill7": "Databases",
        "skill8": "Version Control",
        "skill9": "Machine Learning Libraries",
        "skill10": "Data Exploration",
        "skill11": "Data acquisition and processing, data cleaning, data visualization, one- and two-dimensional analysis (univariate and bivariate analysis), outlier detection, statistical testing",
        "skill12": "Modeling Methods and Techniques",
        "skill13": "Linear and logistic regression, SVM, decision trees, random forests, XGBoost algorithm, cluster analysis",
        "skill14": "Modeling",
        "skill15": "Data transformations, evaluation schemes, hyperparameter optimization, modeling process automation (pipelines), model validation",
        "skill16": "Software",
        "skill17": "Data Science &#10;&#38; Analysis",
        "skill18": "Geographic / GIS",
        "skill19": "Remote Sensing and&nbsp;Photogrammetry",
        "skill20": "Trimble Inpho, TerraSolid, Agisoft Metashape,&#10;Riegl Software, Inertial Explorer, iX Capture,&#10;CATALYST od PCI Geomatics",
        "skill21": "Graphic and Creative",
        "skill22": "Soft Skills",
        "skill23": "Communication",
        "skill24": "I communicate fluently (in writing and orally) with colleagues and clients",
        "skill25": "Problem Solving",
        "skill26": "I can calmly analyze a situation and identify possible solutions",
        "skill27": "Time Management",
        "skill28": "I am capable of managing multiple tasks simultaneously",
        "skill29": "Responsibility",
        "skill30": "I am aware of the consequences of my decisions",
        "skill31": "Teamwork",
        "skill32": "I easily collaborate with others to achieve a common goal",
        "skill33": "Flexibility",
        "skill34": "I can adapt to changing project needs",
        "skill35": "Independence",
        "skill36": "I independently complete assigned tasks",
        "skill37": "Leadership",
        "skill38": "I am able to resolve conflicts, monitor progress, and maintain harmony in a group",
        "skill39": "Self-confidence",
        "skill40": "I am confident in my professional skills and freely express my opinions",
        "skill41": "Reliability",
        "skill42": "I perform my duties scrupulously and precisely",
        "skill43": "Basic Programs",
        "skill44": "Operating Systems",
        "skill45": "Communication",
        "skill46": "Collaboration",
        "skill47": "assets/images/skills-circle_newEN.png",
        "portfolio1": "Portfolio",
        "portfolio2": "„If you love what you do and it's making you happy, all the hard work&#10;and persistence will pay off.”",
        "portfolio3": "Filter:",
        "portfolio4": "All<span class=\"category-count\">11</span>",
        "portfolio5": "GIS Projects<span class=\"category-count\">1</span>",
        "portfolio6": "Graphic Projects<span class=\"category-count\">3</span>",
        "portfolio7": "GIS Projects, Front&ndash;End",
        "portfolio8": "Participatory tool &ndash; geosurvey",
        "portfolio9": "OPEN",
        "portfolio10": "Cats vs Dogs Classification using CNN Keras",
        "portfolio11": "Diabetes prediction and risk factors evaluation",
        "portfolio12": "Forecasting prices of single-family houses",
        "portfolio13": "Tytanic Disaster",
        "portfolio14": "Own website &ndash; RESUME",
        "portfolio15": "Web Scraping",
        "portfolio16": "Passwords Generator",
        "portfolio17": "Graphic Projects",
        "portfolio18": "Wedding invitation",
        "portfolio19": "Logo and business cards",
        "contact1": "Contact",
        "contact2": "Who speaks &ndash; sows, who listens &ndash; reaps.",
        "contact3": "Contact me by phone or via the form below",
        "contact4": "Call me",
        "contact5": "Write to me",
        "contact6": "Address",
        "contact7": "Krakow, Poland",
        "contact8": "Your Name*",
        "contact9": "Your E-mail*",
        "contact10": "Your phone number",
        "contact11": "Message title*",
        "contact12": "Message content*",
        "contact13": "Send message",
        "contact14": "Fields marked with * are required"
    }
}