{
    "PL": {
        "menu1": "START",
        "menu2": "O MNIE",
        "menu3": "ŻYCIORYS",
        "menu4": "UMIEJĘTNOŚCI",
        "menu5": "PORTFOLIO",
        "menu6": "KONTAKT",
        "menu7": "Zaprojektowane przez &copy;&nbsp;",
        "home1": "Cześć, jestem",
        "home2": "Mateusz Wuchnicki",
        "home3": "Specjalista ds. GIS, Analityk danych&#10;oraz pasjonat Data Science i&nbsp;uczenia&nbsp;maszynowego&#10;z Krakowa, Polska",
        "home4": "POBIERZ CV",
        "home5": "Wersja polska",
        "home6": "Wersja angielska",
        "about1": "Imię i nazwisko ",
        "about2": "Urodziny ",
        "about3": "1 lutego 1994",
        "about4": "E-mail ",
        "about5": "Adres ",
        "about6": "Kraków, Polska",
        "about7": "Telefon ",
        "about8": "O mnie",
        "about9": "Specjalista ds. GIS, fotogrametrii&#10;i teledetekcji",
        "about10": "Jestem wykwalifikowanym inżynierem z ponad siedmioletnim doświadczeniem. Brałem czynny udział w wielu projektach komercyjnych i&nbsp;badawczo-rozwojowych. Wykonywałem wiele analiz przestrzennych, opracowywałem ortofotomapy, modele terenu oraz chmury punktów pochodzące z lotniczego skaningu laserowego, a także pisałem sprawozdania techniczne. Byłem odpowiedzialny między innymi za planowanie, monitorowanie i koordynowanie misji lotniczych, których celem było pozyskanie wysokorozdzielczych zdjęć lotniczych i chmury punktów ALS. Posiadam wyjątkowe umiejętności analityczne, organizacyjne, planistyczne i&nbsp;komunikacyjne oraz skoncentrowane podejście do pracy w&nbsp;ustrukturyzowanym środowisku. Poszukuję pracy, w&nbsp;której wykorzystam moje umiejętności i będę mógł dalej się rozwijać w szerokopojętej branży GIS.",
        "about11": "Hobby &#124; Zainteresowania",
        "about12": "Zdobywanie szczytów górskich",
        "about13": "Bieganie",
        "about14": "Finanse osobiste&#10;i inwestowanie",
        "about15": "Data Science&#10;&amp; Analysis",
        "about16": "E-Sport",
        "resume1": "Życiorys",
        "resume2": "„Dobre decyzje są wynikiem doświadczenia, a doświadczenie zdobywa się poprzez podejmowanie błędnych decyzji.”",
        "resume3": "&ndash; Mark Twain",
        "resume4": "Doświadczenie",
        "resume5": "Menager ds. technicznych w dziale technologii lotniczych",
        "resume6": "SmallGIS Sp. z o.o. <span>&#124;</span> Kraków",
        "resume7": "W wewnątrznej strukturze firmy pełniłem funkcję menagera do spraw technicznych w dziale technologii lotniczych. Byłem odpowiedzialny za&nbsp;sprawne działanie i merytoryczne wsparcie zespołu analityków oraz&nbsp;personelu technicznego. Równocześnie sprawowałem funkcję nadzoru operacyjnego misji lotniczych.",
        "resume8": "Do moich obowiązków należało:",
        "resume9": "Koordynowanie i nadzorowanie projektów fotogrametrycznych",
        "resume10": "Kierowanie zespołem, zapewnianie wsparcia i zasobów do realizacji zadań",
        "resume11": "Nadzorowanie prac badawczo-rozwojowych nad nowymi technologiami lotniczymi",
        "resume12": "Utrzymywanie dokładnej dokumentacji technicznej i operacyjnej dla systemów lotniczych",
        "resume13": "Optymalizacja procesów produkcji ortofotomap oraz danych LIDAR",
        "resume14": "Organizowanie szkoleń dla zespołu technicznego",
        "resume15": "Identyfikowanie potencjalnych zagrożeń związanych z realizacją projektów",
        "resume16": "Współpraca z klientami w zakresie specyfikacji technicznych wymagań dotyczących produktów lotniczych",
        "resume17": "Analityk ds. GIS, Fotogrametrii &#10;i Teledetekcji",
        "resume18": "Praca w działe technologii lotniczych, w których uczestniczyłem w wielu projektach fotogrametrycznych oraz badawczych. Pełniłem funkcję nadzoru operacyjnego misji lotniczych zapewniając efektywne i bezpieczne przeprowadzenie operacji lotniczych w celu pozyskania zdjęć lotniczych oraz&nbsp;wykonania skaningu laserowego.",
        "resume19": "Przeprowowadzanie analiz geoprzestrzennych",
        "resume20": "Opracowywanie ortofotomap lotniczych oraz danych LiDAR (ALS)",
        "resume21": "Przetwarzanie zobrazowań satelitarnych oraz hiperspektralnych",
        "resume22": "Komplekswe planowanie, monitorowanie i koordynacja misji lotniczych",
        "resume23": "Koordynowanie działań z różnymi organami i jednostkami wojskowymi",
        "resume24": "Tworzenie dokumentacji projektowej oraz raportów z misji lotniczych",
        "resume25": "Bezpośredni kontakt z klientami",
        "resume26": "Technik GIS",
        "resume27": "Pracując w dziele GIS rozwinąłem swoje umiejętności z zakresu przetwarzania danych wektorowych i rastrowych. Poznałem oprogramowanie oraz techniki opracowywania danych przestrzennych. W&nbsp;trakcie pracy na tym stanowisku, przeniosłem się do działu technologii lotniczych.",
        "resume28": "Opracowywanie ortofotomap lotniczych oraz danych LiDAR",
        "resume29": "Przeprowadzanie analiz przestrzennych",
        "resume30": "Przetwarzanie danych wektorowych i rastrowych",
        "resume31": "Prowadzenie szkoleń z zakresu analiz i oprogramowania GIS",
        "resume32": "Bezpośredni kontakt z klientami",
        "resume33": "Stażysta",
        "resume34": "Pracę rozpocząłem po ukończeniu I stopnia studiów. W trakcie stażu uczestniczyłem w wielu projektach GISowych tj. kartowanie największego Arboretum w Polsce, aktualizacja i opracowywanie MPZP, przetwarzanie zdjęć lotniczych dla projektu NCBiR.",
        "resume35": "Przetwarzanie wysokorozdzielczych zdjęć lotniczych i zobrazowań satelitarnych",
        "resume36": "Tworzenie raportów oraz sprawozdań dotyczących analiz i projektów",
        "resume37": "Przetwarzanie i migracja danych z różnych źródeł",
        "resume38": "Przygotowywania dokumentajci technicznej",
        "resume39": "Technik fotogrametrii",
        "resume40": "GEOCARTIS Sp. z o.o. Sp. K. <span>&#124;</span> Poznań",
        "resume41": "Trzy miesięczny staż w branży fotogrametrycznej, w trakcie którego dobrze nauczyłem się tworzyć modele 3D oraz pracy z chmurą punktów pochodzącą ze skaningu laserowego.",
        "resume42": "Tworzenie modeli BIM (np. bloków mieszkaniowych, zajezdni autobudowych)",
        "resume43": "Opracowywanie rzutów mieszkań na podstawie chmury punktów TLS",
        "resume44": "Pozyskiwanie chmury punktów TLS z użyciem skanera laserowego Leica",
        "resume45": "Tworzenie kompleksowej dokumentacji projektowej",
        "resume46": "GEOMAT Sp. z o.o. <span>&#124;</span> Poznań",
        "resume47": "Trzy miesięczny staż w branży geodezyjnej, w trakcie którego poznałem narzędzia do projektowania map i baz danych. Udoskonaliłem swoje umiejętności posługiwania się instrumentami geodezyjnymi.",
        "resume48": "Aktualizacja bazy BDOT10k oraz redakcję kartograficzna bazy KARTO10k",
        "resume49": "Kontrola atrybutów obiektów bazy GESUT oraz tworzenie map tematycznych",
        "resume50": "Wykonywanie pomiarów geodezyjnych",
        "resume51": "Kursy i szkolenia",
        "resume52": "Sages, Kodołamacz <span>&#124;</span> Warszawa",
        "resume53": "Kurs online, 420 godz.",
        "resume54": "Intensywny, połroczny kurs Data Science, dzięki któremu sprawnie posługuję się językiem python oraz jego bibliotekami służącymi do analizy danych.",
        "resume55": "Nabyte umiejętności:",
        "resume56": "Python: NumPy, Pandas, Matplotlib, Seaborn, Scikit-learn, Keras",
        "resume57": "Jupyter Notebook (Linux), PyCharm, Google Colaborator, SQL, kontrola wersji Git",
        "resume58": "Metody uczenia maszynowego oraz techniki modelowania: szeregi czasowe, regresja liniowa i logistyczna, SVM, drzewa decyzyjne, lasy losowe, PCA, analiza skupień, algorytm XGBoost",
        "resume59": "Pozyskiwanie i procesowanie danych z różnych źródeł: .csv, .xml, .json",
        "resume60": "Transformacje danych, schematy ewaluacji (train&ndash;test, walidacja krzyżowa), ocena istotności zmiennych",
        "resume61": "Optymalizacja hiperparametrów, automatyzacja procesu modelowania (pipelines), walidacja modeli",
        "resume62": "Statystyczne metody analizy danych, estymacja i weryfikacja",
        "resume63": "Podstawowe sieci neuronowe (Deep learning), klasyfikacja obrazów i tekstów",
        "resume64": "Python for Data Science and Machine Learning",
        "resume65": "Kurs online, 25 godz.",
        "resume66": "Python: NumPy, Pandas, Matplotlib, Scikit-learn",
        "resume67": "Jupyter Notebook (Linux), PyCharm",
        "resume68": "Metody uczenia maszynowego: regresja liniowa i logistyczna, drzewa decyzyjne i lasy losowe",
        "resume69": "Python dla początkujących",
        "resume70": "Kurs online, 25 godz.",
        "resume71": "Python: pętle, instrukcje warunkowe, funkcje",
        "resume72": "IDLE, PyCharm",
        "resume73": "Awans Kompetencyjny",
        "resume74": "Uniwersytet im. Adama Mickiewicza <span>&#124;</span> Poznań",
        "resume75": "Staż stacjonarny, 3 miesiące",
        "resume76": "Innowacyjne kompetencje geografa na współczesnym rynku pracy: wysokiej jakości program stażowy dla studentów nauk o Ziemi na&nbsp;Wydziale Nauk Geograficznych i Geodezyjnych na Uniwersytecie im.&nbsp;Adama Mickiewicza w Poznaniu.",
        "resume77": "Wykształcenie",
        "resume78": "Geoinformacja <span>&#124;</span> Inżynier",
        "resume79": "<span class=\"underline\">Temat pracy inżynierskiej:</span> „Aplikacja mapowa z funkcjonalnością geokwestionariusza &ndash; szablon portalu geoinformacyjnego”",
        "resume80": "Aplikacja internetowa będąca kreatorem portalu geoinformacyjnego umożliwiająca stworzenie dowolnej ankiety w oparciu o dane przestrzenne z podkładem mapowym.&#10;(Technologie: HTML, CSS, JavaScript, PHP)",
        "skill1": "Umiejętności",
        "skill2": "„Bardzo wierzę w szczęście i uważam, że im ciężej pracuję, tym więcej go mam.”",
        "skill3": "Znajomość języków",
        "skill4": "Kliknij tutaj",
        "skill5": "Języki obce",
        "skill6": "Polski (ojczysty), Angielski (B2)",
        "skill7": "Bazy danych",
        "skill8": "Kontrola wersji",
        "skill9": "Biblioteki uczenia maszynowego",
        "skill10": "Eksploracja danych",
        "skill11": "Pozyskiwanie i procesowanie danych, czyszczenie danych, wizualizacja danych, analiza jednoczynnikowa&#10;i dwuwymiarowa, wykrywanie wartości odstających, testowanie statystyczne",
        "skill12": "Metody i techniki modelowania",
        "skill13": "Regresja liniowa i logistyczna, SVM, drzewa decyzyjne,&#10;lasy losowe, algorytm XGBoost, analiza skupień",
        "skill14": "Modelowanie",
        "skill15": "Transformacje danych, schematy ewaluacji, optymalizacja hiperparametrów, automatyzacja procesu modelowania (pipelines), walidacja modeli",
        "skill16": "Oprogramowanie",
        "skill17": "Data Science &#10;&#38; Analysis",
        "skill18": "Geograficzne / GIS",
        "skill19": "Teledetekcja&#10;i&nbsp;Fotogrametria",
        "skill20": "Trimble Inpho, TerraSolid, Agisoft Metashape,&#10;Riegl Software, Inertial Explorer, iX Capture,&#10;CATALYST od PCI Geomatics",
        "skill21": "Graficzne i kreatywne",
        "skill22": "Umiejętności miękkie",
        "skill23": "Komunikacja",
        "skill24": "Płynnie komunikuję się (w formie pisemnej i ustnej) ze współpracownikami i klientami",
        "skill25": "Rozwiązywanie problemów",
        "skill26": "Potrafię spokojnie przeanalizować sytuację i zidentyfikować możliwe rozwiązania",
        "skill27": "Zarządzanie czasem",
        "skill28": "Potrafię efektywnie zarządzać wieloma zadaniami jednocześnie",
        "skill29": "Odpowiedzialność",
        "skill30": "Jestem świadomy konsekwencji swoich decyzji",
        "skill31": "Praca zespołowa",
        "skill32": "Posiadam łatwość współpracy z innymi, aby osiągnąć wspólny cel",
        "skill33": "Elastyczność",
        "skill34": "Potrafię dostosować się do zmieniających się potrzeb projektowych",
        "skill35": "Samodzielność",
        "skill36": "Samodzielnie wykonuję powierzone mi zadania",
        "skill37": "Przywództwo",
        "skill38": "Potrafię rozwiązywać konflikty, monitorować postępy i utrzymać harmonię w grupie",
        "skill39": "Pewność siebie",
        "skill40": "Jestem pewny swoich umiejętności zawodowych, swobodnie wyrażam swoje opinie",
        "skill41": "Rzetelność",
        "skill42": "Skrupulatnie i dokładnnie wykonuje obowiązki",
        "skill43": "Podstawowe programy",
        "skill44": "Systemy opracyjne",
        "skill45": "Komunikacja",
        "skill46": "Współpraca",
        "skill47": "assets/images/skills-circle_newPL.png",
        "portfolio1": "Portfolio",
        "portfolio2": "„Jeśli kochasz to co robisz i sprawia Ci to radość, cała ciężka praca&#10;i wytrwałość się opłacią.”",
        "portfolio3": "Filtruj:",
        "portfolio4": "Wszystkie<span class=\"category-count\">11</span>",
        "portfolio5": "Projekty GIS<span class=\"category-count\">1</span>",
        "portfolio6": "Projekty graficzne<span class=\"category-count\">3</span>",
        "portfolio7": "Projekty GIS, Front-End",
        "portfolio8": "Narzędzie partycypacji społecznej &ndash; geoankieta",
        "portfolio9": "OTWÓRZ",
        "portfolio10": "Klasyfikacja kotów i psów z użyciem CNN Keras",
        "portfolio11": "Rozpoznanie cukrzycy i ocena czynników ryzyka",
        "portfolio12": "Prognozowanie cen domów jednorodzinnych",
        "portfolio13": "Katastrofa Tytanika",
        "portfolio14": "Własna strona &ndash; CV",
        "portfolio15": "Pobieranie danych ze stron WWW",
        "portfolio16": "Generator haseł",
        "portfolio17": "Projekty graficzne",
        "portfolio18": "Zaproszenia ślubne",
        "portfolio19": "Logo i wizytówki",
        "contact1": "Kontakt",
        "contact2": "Kto mówi &ndash; sieje, kto słucha &ndash; zbiera.",
        "contact3": "Skontaktuj się ze mną telefonicznie lub poprzez formularz poniżej",
        "contact4": "Zadzwoń do mnie",
        "contact5": "Napisz do mnie",
        "contact6": "Adres",
        "contact7": "Kraków, Polska",
        "contact8": "Twoje Imię*",
        "contact9": "Twój adres E-mail*",
        "contact10": "Twój numer telefonu",
        "contact11": "Tytuł wiadomości*",
        "contact12": "Treść wiadomości*",
        "contact13": "Wyślij wiadomość",
        "contact14": "Pole oznaczone * są wymagane",
        "footer1": "Zaprojektowane przez &copy;&nbsp;",
        "model_all1": "Szczegóły projektu",
        "model_all2": "Kategoria:",
        "model_all3": "Projekty GIS, Front-End web development",
        "model_all4": "Data:",
        "model_all5": "Design:",
        "model_all6": "Technologia",
        "model_all7": "Zobacz projekt",
        "model_all8": "Opis projektu",
        "model_all9": "Dane z:",
        "model1_1": "Narzędzie partycypacji społecznej &ndash; geoankieta",
        "model1_2": "Luty 2016",
        "model1_3": "Prezentowany projekt to moja praca inżynierska pod tytułem „Aplikacja mapowa z funkcjonalnością geo-kwestionariusza &ndash; szablon portalu geoinformacyjnego”.",
        "model1_4": "Jest to aplikacja internetowa będąca kreatorem portalu geoinformacyjnego umożliwiająca stworzenie dowolnej ankiety w oparciu o dane przestrzenne z podkładem mapowym. Została ona wykorzystana w projekcie naukowym finansowanym przez Narodowe Centrum Nauki pod tytułem „Partycypacyjny paradygmat planowania przestrzennego &ndash; identyfikacja stanu oraz budowa modelu partycypacji w planowaniu przestrzennym w polskim dużym mieście” o numerze: 2014/15/B/HS4/00839 kierowanym przez prof. dr hab Jacka Kotusa.",
        "model1_5": "<span>Generator geoankiety</span>",
        "model1_6": "Jest to dashboard dla administratora geoankiety. Pozwala stworzyć geoankietę na dowolny temat, w której kluczowym jest zebranie informacji przestrzennej od ankietowanych. Generator pozwala na ustawienie tytułu samej ankiety oraz umożliwia utworzenie tekstu powitalnego i podziękowania za udział w ankiecie. W czwartym kroku administator ma możliwość określenia ile pytań będzie w geoankiecie oraz jakiego typu będzie do nich odpowiedź. Osoba biorąca udział w badaniu będzie miała możliwość udzielenia odpowiedzi na zadanie pytanie poprzez zaznaczenie konkretnej lokalizacji przy użyciu punktu, linii łamanej lub poligonu. Aby korespondent mógł odróżnić zaznaczenia na mapie, administrator może ustawić różny kolor dla poszczególnych pytań i odpowiedzi. Koleją opcją jest wybranie podkładu mapowego jaki będzie wyświetlał się w geoankiecie oraz przybliżenia startowego, co pozwoli zawęzić obszar na mapie, w którym możliwe będzie udzielenie odpowiedzi.",
        "model1_7": "Po kliknięciu w przycisk <span>GENERUJ GEOANKIETĘ</span>, administrator otrzymuje informacje czy wszystkie dane zostały prawidłowo wypełnione oraz odnośnik do gotowej geoankiety.",
        "model1_8": "Cały generator jest połączony z bazą SQL, w której zapisywane są wszystkie ustawienia administratora.",
        "model1_9": "<span>Panel logowania</span>",
        "model1_10": "Administrator ma możliwość utworzenia dowolnej liczby kont, które będą miały dostęp do pytań zawartych w geoankiecie. Konta należy utworzyć bezpośrednio w dedykowanej bazie danych SQL. Każdy ankietowany przed przystąpieniem będzie musiał najpierw prowadzić dane do logowania.",
        "model1_11": "Dzięki temu rozwiązaniu administrator geoankiety ma możliwość sprawdzenia odpowiedzi danej osoby.",
        "model1_12": "Jeśli projektankt geoankiety uzna, że odpowiedzi na pytania mają być anonimowe, ma możliwość zrezygnowania z panelu logowania.",
        "model1_13": "<span>Panel powitalny</span>",
        "model1_14": "To panel rozpoczynający uczestnictwo w geoankiecie. Korespondent zostaje wprowadzony w tematykę badania w jakim bierze ucział. Tekst powitalny został przygotowany na etapie generowania geoankiety przez administratowa.",
        "model1_15": "Po kliknięciu w przcisk <span>Rozpocznij badanie</span>, korespondent zostanie przesiony do przygotowanych pytań. W prawym górnym rogu mamy informację jaka osoba jest zalogowana do geoankiety. Istnieje również możliwość zrezygnowania z udziału poprzez wylogowanie się.",
        "model1_16": "<span>Geoankieta &ndash; odpowiadanie na pytania</span>",
        "model1_17": "Panele z pokładem mapowym to kluczowe elementy geoankiety. To właśnie tutaj jest możliwość odpowiadania na przygotowane pytania. Liczba etapów generowana jest automatycznie oraz jest zależna od liczby przygotowanych pytań. Każdy etap zkłąda się z maksymalnie 2 pytań, aby zaznaczenia na mapie były przejrzyste dla korespondenta.",
        "model1_18": "Po udzieleniu odpowiedzi poprzez zaznaczenie punktu lub narysowanie lini czy obszaru, osoba ma możliwość przejścia dalej aby kontunuować badanie. W każdym momencie może wrócić do porzedniego etapu i zmienić odpowiedź.",
        "model1_19": "<span>Panel końcowy</span>",
        "model1_20": "Panel końcowy to ostatni element geoankiety, w którym użytkownik otrzymuje podziękowanie za udział w przygotowanym badaniu. Tekst tego podziękowania jest możliwy do personalizacji na etapie generatora geoankiety.",
        "model1_21": "Po kliknięciu w przycisk <span>Wyloguj się i zakończ badanie</span>, udzielone odpowiedzi zostają zatwierdzone i przesłane do bazy danych SQL wraz z oznaczeniem, który użytkownik ich udzielił.",
        "model2_1": "Klasyfikacja kotów i psów z użyciem CNN Keras",
        "model2_2": "Maj 2024",
        "model2_3": "Rozpoznanie i nazwanie zwierzęcia lub przedmiotu nie stanowi dla człowieka większego problemu. Jednak czy dla komputera będzie to równie proste, dysponując jedynie zdjęciem czworonoga? Jako, że interesuję się uczeniem maszynowym, nie mogłem przejść obok takiego pytania obojętnie. Postanowiłem sprawdzić czy oraz z jaką skutecznością komputer będzie w stanie rozpoznać gatunek zwięrzęcia przedstawiony na zdjęciu.",
        "model2_4": "Klasyfikacja psów i kotów to jeden ze standardowych projektów głębokiego uczenia z zakresu widzenia komputerowego, który obejmuje klasyfikację realistycznych zdjęć na dwie kategorie. W trakcie realizacji projektu musiałem najpierw załadować i przygotować obrazy do celów treningowych, a następnie rozdzielić zdjęcia na zbiór danych do celu szkolenia i walidacji. Kolejno, użyłem ImageDataGenerator, aby rozszerzyć swój zbiór danych i ograniczyć nadmierne dopasowanie. Opracowałem model CNN za pomocą biblioteki KERAS i wybrałem parametry aby poprawić jego wydajność. W następnym kroku oceniłem wydajność modelu, zapisałem i załadowałem model do dalszych prognoz, a na koniec dokonałem klasyfikacji na zwierzętach będących w mojej rodzinie.",
        "model2_5": "Do realizacji projektu wykorzystałem zbiór danych obejmujący łącznie 25000 zdjęć przedstawiających psy i koty. Ten zbiór danych został po raz pierwszy wprowadzony na potrzeby konkursu Kaggle w 2013 roku.",
        "model2_6": "Zbiór danych jest dostępny <a href=\"https://www.kaggle.com/datasets/shaunthesheep/microsoft-catsvsdogs-dataset/data/\" target=\"_blank\" rel=\"noopener noreferrer\">tutaj</a> (około 865 MB).",
        "model2_7": "Aby dokonać klasyfikacji obrazów na dwie kategorie: psy i koty, zastosowałem do tego konwolucyjną sieć neuronową (CNN &ndash; convolutional neural network).",
        "model2_8": "Architektura modelu:",
        "model2_9": "Warstwy:",
        "model2_10": "Warstwa wejściowa składa się z warstwy Conv2D z 32 filtrami i funkcją aktywacji ReLU.",
        "model2_11": "Model zawiera 3 bloki konwolucyjne z rosnącymi liczbą filtrów i aktywacją ReLU.",
        "model2_12": "Każdy blok konwolucyjny zawiera normalizację wsadową (Batch Normalization), maksymalne próbkowanie (Max Pooling) (rozmiar siatki &#61; 2) i warstwę Dropout (0,2).",
        "model2_13": "Warstwy w pełni połączone zawierają warstwę spłaszczającą (Flatten), warstwę Dense z 512 jednostkami i warstwę Dropout.",
        "model2_14": "Warstwa wyjściowa to warstwa Dense z 2 jednostkami i aktywacją softmax.",
        "model2_15": "Komponenty:",
        "model2_16": "Warstwa wejściowa: Odbiera obrazy wejściowe do klasyfikacji.",
        "model2_17": "Warstwy splotowe: Wyodrębniają cechy z obrazów za pomocą operacji konwolucyjnych.",
        "model2_18": "Warstwy próbkowania: Zmniejszają przestrzenne wymiary obiektów.",
        "model2_19": "Warstwa spłaszczająca: Przekształca mapy obiektów 2D na wektor 1D.",
        "model2_20": "Warstwy w pełni połączone: Wykonują klasyfikację za pomocą gęsto połączonych warstw.",
        "model2_21": "Warstwa wyjściowa: Dostarcza końcowe prawdopodobieństwa predykcji dla klas kota i psa.",
        "model2_22": "Z sukcesem zbudowałem model głębokiej sieci neuronowej poprzez wdrożenie konwolucyjnej sieci neuronowej (CNN), który uzyskał ponad 6,8 mln parametrów uczących się. Przełożyło się to na uzyskanie bardzo dużej dokładności zaklasyfikowania obrazów na poziomie <span>około 94%</span> zarówno dla psów i kotów.",
        "model2_23": "Po nauczeniu i walidacji modelu przyszedł czas na odpowiedź czy moje zwierzęta to odpowiednio psy i koty. Ostatecznie komputer potwierdził moje zdanie. <span>Pełen sukces.</span>",
        "model6_1": "Własna strona &ndash; CV",
        "model6_2": "Stale aktualizowana",
        "model6_3": "Pomysł utworzenia własnej strony internetowej w stylu portfolio narodził się już dawno temu. Impulsem do działania była m.in. chęć podzielenia się z innymi osobami samodzielnie zrealizowanymi projektami z różnych kategorii. Z uwagi na to, że ciężko jest przedstawić swoje dokonania na kartce papieru w formacie A4, postanowiłem zbudować tę stronę. Jest ona swego rodzaju rozbudowanym interaktywnym życiorysem, w którym umieściłem informacje o sobie, zdobytym doświadczeniu zawodowym i wykształceniu, a także projekty wraz z odnośnikami do ich kodu źródłowego.",
        "model6_4": "Strona jest responsywna. Starałem się przygotować ją tak aby prawidłowo uruchamiała się na każdym urządzeniu. Planuję stale aktualizować wszystkie informacje jakie się tutaj znajdują oraz dodawać nowe projekty, zarówno ukończone jak i w trakcie realizacji.",
        "model6_5": "Niedawno na stronie pojawiła się nowa funkcjonalność, mianowicie możliwość uruchomienia strony w wersji w języku angielskim. W przyszłości możliwe, że pojawi się nowa pozycja w menu &ndash; <span>Blog</span>, w którym będę umieszczał ciekawe nowinki z branży GIS oraz Data Science czy też popularnego teraz AI.",
        "model6_6": "Jeśli chcesz się ze mną skontaktować zapraszam do sekcji <span>Kontakt</span>."
    },
    "EN": {
        "menu1": "HOME",
        "menu2": "ABOUT ME",
        "menu3": "RESUME",
        "menu4": "SKILLS",
        "menu5": "PORTFOLIO",
        "menu6": "CONTACT",
        "menu7": "Designed by &copy;&nbsp;",
        "home1": "Hello, I'm",
        "home2": "Mateusz Wuchnicki",
        "home3": "GIS Specialist, Data Analyst&#10;and enthusiast of Data Science and&nbsp;Machine&nbsp;Learning&#10;from Krakow, Poland",
        "home4": "DOWNLOAD CV",
        "home5": "Polish version",
        "home6": "English version",
        "about1": "Name and Surname ",
        "about2": "Birthday ",
        "about3": "February 1, 1994",
        "about4": "Email ",
        "about5": "Address ",
        "about6": "Krakow, Poland",
        "about7": "Phone ",
        "about8": "About Me",
        "about9": "Specialist in GIS, Photogrammetry&#10;and Remote Sensing",
        "about10": "I am a qualified engineer with 7&#43; years of experience. I&nbsp;have actively participated in numerous commercial and research-development projects. I&nbsp;have conducted many spatial analyses, developed orthophotomaps, terrain models, and point clouds from airborne laser scanning, as well as written technical reports. I&nbsp;have been responsible for planning, monitoring, and&nbsp;coordinating flight missions aimed at acquiring high-resolution aerial photos and ALS point clouds. I possess exceptional analytical, organizational, planning, and communication skills, along with a focused approach to working in a structured environment. I am seeking a job where I can utilize my skills and continue to grow within the broad GIS industry.",
        "about11": "Hobbies &#124; Interests",
        "about12": "Mountain Climbing",
        "about13": "Running",
        "about14": "Personal Finance&#10;&amp; Investing",
        "about15": "Data Science&#10;&amp; Analysis",
        "about16": "E-Sport",
        "resume1": "Resume",
        "resume2": "„Good decisions come from experience. Experience comes from making bad decisions.”",
        "resume3": "&ndash; Mark Twain",
        "resume4": "Work Experience",
        "resume5": "Technical Manager in the Aviation Technology Department",
        "resume6": "SmallGIS Sp. z o.o. <span>&#124;</span> Krakow",
        "resume7": "Within the company's internal structure, I served as a technical manager in the aviation technology department. I was responsible for the efficient operation and substantive support of the team of analysts and technical staff. At the same time, I performed the function of operational supervision of aviation missions.",
        "resume8": "My duties included:",
        "resume9": "Coordinating and supervising photogrammetric projects",
        "resume10": "Leading a team, providing support and resources to accomplish tasks",
        "resume11": "Supervising research and development work on new aviation technologies",
        "resume12": "Maintaining accurate technical and operational documentation for aviation systems",
        "resume13": "Optimizing production processes for orthophotos and LIDAR data",
        "resume14": "Organizing training for the technical team",
        "resume15": "Identifying potential risks associated with project implementation",
        "resume16": "Collaborating with clients on technical specifications for aviation products",
        "resume17": "GIS, Photogrammetry and Remote Sensing Analyst",
        "resume18": "Working in the aviation technology department, where I participated in many photogrammetric and research projects. I served as operational supervisor of aviation missions, ensuring efficient and safe conduct of aviation operations to obtain aerial images and perform laser scanning.",
        "resume19": "Conducting geospatial analyses",
        "resume20": "Developing aerial orthophotos and LiDAR (ALS) data",
        "resume21": "Processing satellite and hyperspectral imagery",
        "resume22": "Comprehensive planning, monitoring, and coordination of aviation missions",
        "resume23": "Coordinating activities with various authorities and military units",
        "resume24": "Creating project documentation and reports from aviation missions",
        "resume25": "Direct contact with clients",
        "resume26": "GIS Technician",
        "resume27": "While working in the GIS department, I developed my skills in vector and raster data processing. I learned software and techniques for developing spatial data. While working in this position, I moved to the aviation technology department.",
        "resume28": "Developing aerial orthophotos and LiDAR data",
        "resume29": "Conducting spatial analyses",
        "resume30": "Processing vector and raster data",
        "resume31": "Conducting training in GIS analysis and software",
        "resume32": "Direct contact with clients",
        "resume33": "Intern",
        "resume34": "I started work after completing my first degree studies. During my internship, I participated in many GIS projects, such as mapping the largest Arboretum in Poland, updating and developing spatial development plans, and processing aerial images for the project of the National Centre for Research and Development (NCBR).",
        "resume35": "Processing high-resolution aerial images and satellite imagery",
        "resume36": "Creating reports and reports on analyzes and projects",
        "resume37": "Processing and migrating data from various sources",
        "resume38": "Preparing technical documentation",
        "resume39": "Photogrammetry Technician",
        "resume40": "GEOCARTIS Sp. z o.o. Sp. K. <span>&#124;</span> Poznan",
        "resume41": "A three-month internship in the photogrammetry industry, where I learned to create 3D models and work with point clouds from laser scanning.",
        "resume42": "Creating BIM models (e.g., residential blocks, bus depots)",
        "resume43": "Developing apartment layouts based on TLS point clouds",
        "resume44": "Acquiring TLS point clouds using a Leica laser scanner",
        "resume45": "Creating comprehensive project documentation",
        "resume46": "GEOMAT Sp. z o.o. <span>&#124;</span> Poznan",
        "resume47": "A three-month internship in the geodesy industry, during which I learned tools for designing maps and databases. I improved my skills in using surveying instruments.",
        "resume48": "Updating the BDOT10k database and cartographic editing of the KARTO10k database",
        "resume49": "Controlling the attributes of GESUT database objects and creating thematic maps",
        "resume50": "Conducting geodetic measurements",
        "resume51": "Courses and Training",
        "resume52": "Sages, Kodołamacz <span>&#124;</span> Warsaw",
        "resume53": "Online course, 420 hours",
        "resume54": "An intensive, six-month Data Science course, thanks to which I am proficient in Python and its libraries for data analysis.",
        "resume55": "Skills acquired:",
        "resume56": "Python: NumPy, Pandas, Matplotlib, Seaborn, Scikit-learn, Keras",
        "resume57": "Jupyter Notebook (Linux), PyCharm, Google Colaboratory, SQL, version control Git",
        "resume58": "Machine learning methods and modeling techniques: time series, linear and logistic regression, SVM, decision trees, random forests, PCA, cluster analysis, XGBoost algorithm",
        "resume59": "Acquiring and processing data from various sources: .csv, .xml, .json",
        "resume60": "Data transformations, evaluation schemes (train&ndash;test, cross-validation), variable importance assessment",
        "resume61": "Hyperparameter optimization, automation of the modeling process (pipelines), model validation",
        "resume62": "Statistical methods of data analysis, estimation, and verification",
        "resume63": "Basic neural networks (Deep Learning), image and text classification",
        "resume64": "Python for Data Science and Machine Learning",
        "resume65": "Online course, 25 hours",
        "resume66": "Python: NumPy, Pandas, Matplotlib, Scikit-learn",
        "resume67": "Jupyter Notebook (Linux), PyCharm",
        "resume68": "Machine learning methods: linear and logistic regression, decision trees and random forests",
        "resume69": "Python for Beginners",
        "resume70": "Online course, 25 hours",
        "resume71": "Python: loops, conditional instructions, functions",
        "resume72": "IDLE, PyCharm",
        "resume73": "Awans Kompetencyjny&#10;internship-programme",
        "resume74": "Adam Mickiewicz University <span>&#124;</span> Poznan",
        "resume75": "On-site internship, 3 months",
        "resume76": "Innovative competencies of a geographer in the modern job market: a high-quality internship program for students of Earth Sciences at the Faculty of Geographical and Geological Sciences at Adam Mickiewicz University in Poznan.",
        "resume77": "Education",
        "resume78": "Geoinformation <span>&#124;</span> Bachelor of Science",
        "resume79": "<span class=\"underline\">Thesis topic:</span> „Map Application with Geo–Survey Functionality &ndash; Geoinformation Portal Template”",
        "resume80": "A web application serving as a creator of a geoinformation portal enabling the creation of any survey based on spatial data with a map background.&#10;(Technologies: HTML, CSS, JavaScript, PHP)",
        "skill1": "Skills",
        "skill2": "„I am a great believer in luck, and I find the harder I work the more I have of it.”",
        "skill3": "Languages",
        "skill4": "Click here",
        "skill5": "Foreign Languages",
        "skill6": "Polish (native), English (B2)",
        "skill7": "Databases",
        "skill8": "Version Control",
        "skill9": "Machine Learning Libraries",
        "skill10": "Data Exploration",
        "skill11": "Data acquisition and processing, data cleaning, data visualization, one- and two-dimensional analysis (univariate and bivariate analysis), outlier detection, statistical testing",
        "skill12": "Modeling Methods and Techniques",
        "skill13": "Linear and logistic regression, SVM, decision trees, random forests, XGBoost algorithm, cluster analysis",
        "skill14": "Modeling",
        "skill15": "Data transformations, evaluation schemes, hyperparameter optimization, modeling process automation (pipelines), model validation",
        "skill16": "Software",
        "skill17": "Data Science &#10;&#38; Analysis",
        "skill18": "Geographic / GIS",
        "skill19": "Remote Sensing and&nbsp;Photogrammetry",
        "skill20": "Trimble Inpho, TerraSolid, Agisoft Metashape,&#10;Riegl Software, Inertial Explorer, iX Capture,&#10;CATALYST od PCI Geomatics",
        "skill21": "Graphic and Creative",
        "skill22": "Soft Skills",
        "skill23": "Communication",
        "skill24": "I communicate fluently (in writing and orally) with colleagues and clients",
        "skill25": "Problem Solving",
        "skill26": "I can calmly analyze a situation and identify possible solutions",
        "skill27": "Time Management",
        "skill28": "I am capable of managing multiple tasks simultaneously",
        "skill29": "Responsibility",
        "skill30": "I am aware of the consequences of my decisions",
        "skill31": "Teamwork",
        "skill32": "I easily collaborate with others to achieve a common goal",
        "skill33": "Flexibility",
        "skill34": "I can adapt to changing project needs",
        "skill35": "Independence",
        "skill36": "I independently complete assigned tasks",
        "skill37": "Leadership",
        "skill38": "I am able to resolve conflicts, monitor progress, and maintain harmony in a group",
        "skill39": "Self-confidence",
        "skill40": "I am confident in my professional skills and freely express my opinions",
        "skill41": "Reliability",
        "skill42": "I perform my duties scrupulously and precisely",
        "skill43": "Basic Programs",
        "skill44": "Operating Systems",
        "skill45": "Communication",
        "skill46": "Collaboration",
        "skill47": "assets/images/skills-circle_newEN.png",
        "portfolio1": "Portfolio",
        "portfolio2": "„If you love what you do and it's making you happy, all the hard work&#10;and persistence will pay off.”",
        "portfolio3": "Filter:",
        "portfolio4": "All<span class=\"category-count\">11</span>",
        "portfolio5": "GIS Projects<span class=\"category-count\">1</span>",
        "portfolio6": "Graphic Projects<span class=\"category-count\">3</span>",
        "portfolio7": "GIS Projects, Front-End",
        "portfolio8": "Social participation tool &ndash; Geo–Survey",
        "portfolio9": "OPEN",
        "portfolio10": "Cats vs Dogs Classification using CNN Keras",
        "portfolio11": "Diabetes prediction and risk factors evaluation",
        "portfolio12": "Forecasting prices of single-family houses",
        "portfolio13": "Tytanic Disaster",
        "portfolio14": "Own website &ndash; RESUME",
        "portfolio15": "Web Scraping",
        "portfolio16": "Passwords Generator",
        "portfolio17": "Graphic Projects",
        "portfolio18": "Wedding invitation",
        "portfolio19": "Logo and business cards",
        "contact1": "Contact",
        "contact2": "Who speaks &ndash; sows, who listens &ndash; reaps.",
        "contact3": "Contact me by phone or via the form below",
        "contact4": "Call me",
        "contact5": "Write to me",
        "contact6": "Address",
        "contact7": "Krakow, Poland",
        "contact8": "Your Name*",
        "contact9": "Your E-mail*",
        "contact10": "Your phone number",
        "contact11": "Message title*",
        "contact12": "Message content*",
        "contact13": "Send message",
        "contact14": "Fields marked with * are required",
        "footer1": "Designed by &copy;&nbsp;",
        "model_all1": "Project Details",
        "model_all2": "Category:",
        "model_all3": "GIS Projects, Front-End Web Development",
        "model_all4": "Date:",
        "model_all5": "Design:",
        "model_all6": "Technology",
        "model_all7": "View Project",
        "model_all8": "Project Description",
        "model_all9": "Data from:",
        "model1_1": "Social participation tool &ndash; Geo–Survey",
        "model1_2": "February 2016",
        "model1_3": "The presented project is my engineering thesis titled „Map Application with Geo–Survey Functionality &ndash; Geoinformation Portal Template”.",
        "model1_4": "It is a web application that serves as a creator of geoinformation portals, enabling the creation of any survey based on spatial data with a map overlay. It was used in a scientific project funded by the National Science Center titled „Participatory spatial planning paradigm &ndash; the diagnossis of state and creating model of public participation in spatial planning of the Polish big city” with the number: 2014/15/B/HS4/00839, directed by Prof. Dr. Hab. Jacek.",
        "model1_5": "<span>Geo–Survey Generator</span>",
        "model1_6": "This is a dashboard for the Geo–Survey administrator. It allows the creation of a Geo–Survey on any topic, where the key aspect is gathering spatial information from respondents. The generator allows setting the title of the survey but also enables the creation of a welcome text and a thank you note for participating in the survey. In the fourth step, the administrator has the opportunity to determine how many questions will be in the Geo–Survey and what type of answers will be provided. The person taking part in the survey will have the opportunity to answer the question by selecting a specific location using a point, broken line or polygon. In order to differentiate markings on the map, the administrator can set different colors for individual questions and answers. This allows limiting the area available for responses.",
        "model1_7": "After clicking the <span>GENERATE Geo–Survey</span> button, the administrator receives information on whether all data has been correctly filled out and a link to the completed Geo–Survey.",
        "model1_8": "The entire generator is connected to an SQL database where all administrative settings are saved.",
        "model1_9": "<span>Login Panel</span>",
        "model1_10": "The administrator has the ability to create any number of accounts that will have access to the questions in the Geo–Survey. Accounts must be created directly in the dedicated SQL database. Each respondent must first provide login details.",
        "model1_11": "This solution allows the Geo–Survey administrator to verify the responses of a given individual.",
        "model1_12": "If the creator of the Geo–Survey decides that the responses to the questions should be anonymous, they have the option to skip the login panel.",
        "model1_13": "<span>Welcome Panel</span>",
        "model1_14": "This panel initiates participation in the Geo–Survey. The respondent is introduced to the topic of the study in which they are participating. The welcome text was prepared at the stage of generating the Geo–Survey by the administrator. ",
        "model1_15": "After clicking the <span>Start Survey</span> button, the respondent will be directed to the prepared questions. In the upper right corner, there is information about who is logged into the Geo–Survey. There is also an option to withdraw from participation by logging out.",
        "model1_16": "<span>Geo–Survey &ndash; Answering Questions</span>",
        "model1_17": "Panels with map overlays are the key elements of the Geo–Survey. This is where respondents can answer the prepared questions. The number of stages is generated automatically and depends on the number of questions prepared. Each stage consists of a maximum of 2 questions to ensure that markings on the map are clear for the respondent.",
        "model1_18": "After providing answers by marking a point or drawing a line or area, the respondent can proceed to continue the survey. At any time, they can return to the previous stage and change their answers.",
        "model1_19": "<span>Final Panel</span>",
        "model1_20": "The final panel is the last element of the Geo–Survey, where the user receives a thank you note for participating in the prepared study. The text of this thank you note can be personalized during the Geo–Survey generator stage.",
        "model1_21": "After clicking the <span>Log Out and Finish Survey</span> button, the provided answers are finalized and sent to the SQL database along with the identification of the user who provided them.",
        "model2_1": "Cat and dog classification using CNN Keras",
        "model2_2": "May 2024",
        "model2_3": "Recognizing and naming an animal or object is not a major problem for humans. But will it be as easy for a computer with only a photo of the pet? As I am interested in machine learning, I could not pass up such a question. I decided to check whether and how accurately the computer would be able to recognize the animal species shown in a given photo.",
        "model2_4": "Classifying dogs and cats is one of the standard deep learning projects in computer vision that involves classifying realistic photos into two categories. During the project, I first had to load and prepare images for training purposes, and then separate the images into a dataset for training and validation purposes. Next, I used ImageDataGenerator to expand the dataset and reduce overfitting. I developed the CNN model using the KERAS library, and selected parameters to improve its performance. In the next step, I assessed the model's performance, saved and loaded the model for further predictions, and finally performed classification of pets in my family. ",
        "model2_5": "I used a dataset consisting of a total of 25,000 images of dogs and cats. This dataset was first introduced for a Kaggle competition in 2013.",
        "model2_6": "The dataset is available <a href=\"https://www.kaggle.com/datasets/shaunthesheep/microsoft-catsvsdogs-dataset/data/\" target=\"_blank\" rel=\"noopener noreferrer\">here</a> (about 865 MB).",
        "model2_7": "To classify images into two categories: dogs and cats, I applied a convolutional neural network (CNN).",
        "model2_8": "Model architecture:",
        "model2_9": "Layers:",
        "model2_10": "Input layer consists of a Conv2D layer with 32 filters and ReLU activation function.",
        "model2_11": "The model includes 3 convolutional blocks with increasing numbers of filters and ReLU activation.",
        "model2_12": "Each convolutional block contains batch normalization, max pooling (grid size &#61; 2), and a Dropout layer (0.2).",
        "model2_13": "Fully connected layers include a Flatten layer, a Dense layer with 512 units, and a Dropout layer.",
        "model2_14": "The output layer is a Dense layer with 2 units and softmax activation.",
        "model2_15": "Components:",
        "model2_16": "Input layer: Receives input images for classification.",
        "model2_17": "Convolutional layers: Extract features from images using convolutional operations.",
        "model2_18": "Pooling layers: Reduce spatial dimensions of the features.",
        "model2_19": "Flatten layer: Converts 2D feature maps into a 1D vector.",
        "model2_20": "Fully connected layers: Perform classification using densely connected layers.",
        "model2_21": "Output layer: Provides final prediction probabilities for dog and cat classes.",
        "model2_22": "I successfully built a deep neural network model by implementing a convolutional neural network (CNN) with over 6.8 million trainable parameters. This resulted in achieving a very high classification accuracy of <span>about 94%</span> for both dogs and cats.",
        "model2_23": "After training and validating the model, it was time to see whether the computer correctly identified my pets as dogs and cats. Ultimately, the computer confirmed my guess. <span>A complete success.</span>",
        "model6_1": "Own website &ndash; RESUME",
        "model6_2": "Constantly updated",
        "model6_3": "The idea of creating my own portfolio-style website came a long time ago. The motivation for this was, among other things, the desire to share my self-implemented projects from various categories with others. Since it's difficult to present all the achievements on an A4 sheet of paper, I decided to build this website. It serves as an extended interactive resume where I have included information about myself, my professional experience and education, as well as projects with links to their source code.",
        "model6_4": "The website is responsive. I made sure to design it so that it works properly on any device. I plan to continuously update all the information on it and add new projects, both completed and ongoing.",
        "model6_5": "Recently, a new functionality has appeared on the website, namely the ability to view it in English. In the future, a new item in the menu might be introduced &ndash; <span>Blog</span>, where I will post interesting news from the GIS and Data Science industries, or the now popular AI.",
        "model6_6": "If you wish to contact me, please visit <span>the Contact section</span>."
    }
}